{
	"home":{
		"play":" APPUYEZ POUR JOUER " 
	},
	"navbar":{
		"profile":"Profil",
		"social":"Social",
		"about":"A propos",
		"mHistory":"Historique des parties",
		"settings":"Reglages"
	},
	"error":{
		"error":"Erreur"
	},
	"gamepage":{
		"pongLower":"Utilisez les fleches haut et bas du clavier pour jouer !",
		"otherGameLower":"Venez essayer notre {INSEREZ JEU ICI} !",
		"tournamentLower":"Participez a un tournoi pour savoir qui est le meilleur (c'est vous!) !",
		"pong":"MODE PONG",
		"otherGame":"MODE AUTRE JEU",
		"tournament":"MODE TOURNOI"
	},
	"login":{
		"username":"Nom d'utilisateur",
		"password":"Mot de passe",
		"login":"Se Connecter",
		"login42":"Se connecter avec 42",
		"signup":"S'enregistrer",
		"successMsg":"Connecte avec succes",
		"errorMsg":"Nom d'utilisateur ou mot de passe invalide",
		"unknownMsg":"Une erreur s'est produite.",
		"notEmpty":"Veuillez entrer un nom d'utilisateur et un mot de passe",
		"notExistingMsg":"L'utilisateur n'existe pas: merci de vous enregistrer avant de vous connecter"
	},
	"signup":{
		"email":"Email",
		"username":"Nom d'utilisateur",
		"password":"Mot de passe",
		"successMsg":"Enregistre avec succes!",
		"confirmPassword":"Confirmer le mot de passe",
		"errorMsg":"Error lors de l'enregistrement.",
		"alreadyMsg":"Un utilisateur avec ce pseudo existe deja",
		"passwordMatch":"Le mot de passe est erronne",
		"unknownMsg":"Une erreur s'est produite."
	},
	"profile":{
		"bio":"BIO",
		"total":"Nombre total de Match",
		"victories":"Victoires",
		"friends":"Amis",
		"overview":"STATS COMPETITIVES",
		"wins":"Victoires",
		"loss":"Defaites",
		"rank":"Classement",
		"aces":"Ace",
		"challenge":"Defiez",
		"winrate":"pourcentage de victoires"
	},
	"social":{
		"search":"A la recherche d'amis ?",
		"type":"Entrez le nom d'utilisateur de la personne que vous cherchez...",
		"add":"Ajoutez en tant qu'ami",
		"all":"Tout les amis",
		"active":"Amis en ligne",
		"blocked":"Utilisateurs bloques",
		"pending":"Demandes en attente"
	},
	"settings":{
		"settings":"Parametre",
		"user":"Utilisateur",
		"privacy":"Vie privee et securite",
		"accessibility":"Accessibilite",
		"bio":"Entrez une bio",
		"pseudo":"Entrez votre nom d'utilisateur",
		"email":"Entrez votre addresse email",
		"changePassword":"Changer votre mot de passe",
		"newPassword":"Nouveau mot de passe",
		"password":"Changez votre mot de passe",
		"showPassword":"Montrez votre mot de passe",
		"errorPassword":"Le mot de passe n'est pas assez fort",
		"confirmPassword":"Confirmer le mot de passe",
		"savePassword":"Sauvegarder les modifications de mots de passe",
		"successMsg":"Modifications enregistrees avec succes",
		"irreversible":"Attention, cette action est irreversible",
		"delete":"Voulez-vous supprimer votre compte ?",
		"deleteSuccess":"Votre compte a ete supprimer",
		"redirection":"Vous allez maintenant etre rediriger vers la page de login dans quelques secondes..."
	},
	"pong":{
		"pongHome":"Pong Maison",
		"joinRoom":"Rejoindre une Salle",
		"createRoom":"Creer une Salle",
		"enterCode":"Entrer un numero de Salle:",
		"join":"Rejoindre",
		"back":"Retour",
		"numberPlayers":"Choisissez le nombre de joueurs",
		"create":"Creer",
		"limitPlayer":"Limite de joueurs",
		"roomCode":"Code de la salle"
	},
	"cookie":{
		"banner":"En continuant à naviguer sur ce site, vous acceptez que nous utilisions des cookies pour le bon fonctionnement du site. Nous n'utilisons pas de cookies à des fins de suivi ou de publicité.",
		"policy":"Politique des cookies",
		"introduction":"Introduction",
		"intro_text":"Notre site web (ci-après : \"le site web\") utilise des cookies et d'autres technologies connexes (par commodité, toutes les technologies sont désignées par le terme \"cookies\"). Des cookies sont également placés par des tiers que nous avons engagés. Dans le document ci-dessous, nous vous informons sur l'utilisation des cookies sur notre site web.",
		"cookie_title":"Que sont les cookies ?",
		"cookie_text":"Les cookies sont de petits fichiers texte qui sont stockés sur votre ordinateur ou votre appareil mobile lorsque vous visitez un site web.",
		"type_title":"Types de cookies que nous utilisons",
		"type_text":"Fonctionnalité : Certains cookies garantissent que certaines parties du site web fonctionnent correctement et que vos préférences d'utilisateur restent connues. En plaçant des cookies fonctionnels, nous facilitons votre visite sur notre site web. Ainsi, vous ne devez pas saisir plusieurs fois les mêmes informations lorsque vous visitez notre site web et, par exemple, les articles restent dans votre panier d'achat jusqu'à ce que vous ayez payé. Nous pouvons placer ces cookies sans votre consentement.",
		"use_title":"Pourquoi nous utilisons des cookies ?",
		"manage_title":"Gestion des cookies",
		"manage_text":"Vous pouvez utiliser votre navigateur Internet pour supprimer automatiquement ou manuellement les cookies. Vous pouvez également spécifier que certains cookies ne doivent pas être placés. Vous pouvez également modifier les paramètres de votre navigateur Internet de manière à recevoir un message chaque fois qu'un cookie est placé. Pour plus d'informations sur ces options, veuillez vous référer aux instructions de la section d'aide de votre navigateur. Veuillez noter que notre site web peut ne pas fonctionner correctement si tous les cookies sont désactivés.",
		"rights_title":"Vos droits en matière de données personnelles",
		"rights_1":"Droit d'accès : Vous avez le droit d'accéder à vos données personnelles dont nous avons connaissance.",
		"rights_2":"Droit de rectification : Vous avez le droit de compléter, de corriger, de faire supprimer ou de bloquer vos données personnelles quand vous le souhaitez.",
		"rights_3":"Si vous nous donnez votre consentement pour traiter vos données, vous avez le droit de révoquer ce consentement et de faire effacer vos données personnelles.",
		"rights_4":"Droit de transférer vos données : Vous avez le droit de demander au responsable du traitement de vous communiquer toutes vos données à caractère personnel et de les transférer dans leur intégralité à un autre responsable du traitement.",
		"rights_5":"Droit d'opposition : Vous pouvez vous opposer au traitement de vos données. Nous nous y conformons, à moins qu'il n'existe des motifs justifiés pour le traitement.",
		"rights_text":"Pour exercer ces droits, veuillez nous contacter. Veuillez vous référer aux coordonnées figurant au bas de la présente politique en matière de cookies. Si vous avez une réclamation concernant la manière dont nous traitons vos données, nous aimerions l'entendre, mais vous avez également le droit de déposer une réclamation auprès de l'autorité de contrôle (l'Autorité de protection des données).",
		"contact_title":"Nous contacter",
		"contact_adress":"Addresse: ",
		"contact_phone":"Numero de telephone: ",
		"contact_email":"Email: ",
		"contact_text":"Pour toute question et/ou commentaire concernant notre politique en matière de cookies et la présente déclaration, veuillez nous contacter en utilisant les informations fournies ci-dessus."
	},
	"chat":{
		"send":"Envoyer",
		"close":"Fermer"
	}
}